manu897/Project-Carl/firmware/hub/sdkconfig.defaults
# Defaults for the hub. Override interactively with `idf.py menuconfig`.

# --- Target chip (ESP32-S3-DevKitC-1) ---
CONFIG_IDF_TARGET="esp32s3"

# --- PSRAM helps the rolling per-node history buffer ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y

# --- Bluetooth (NimBLE host, central role for scanning + camera GATT pull) ---
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_EXT_ADV=n

# --- Wi-Fi + provisioning ---
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_LWIP_DHCP_RESTORE_LAST_IP=y
CONFIG_MDNS_RESOLVE_TEST_SERVICES=n

# --- HTTP server (web dashboard) ---
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=512

# --- LittleFS partition (web assets in firmware/hub/data/) ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- Crypto ---
CONFIG_MBEDTLS_CCM_C=y
CONFIG_MBEDTLS_AES_C=y
CONFIG_MBEDTLS_SSL_CLIENT=y
CONFIG_ESP_TLS_USING_MBEDTLS=y

# --- Optional MQTT bridge (built-in esp-mqtt) ---
CONFIG_MQTT_PROTOCOL_311=y
